szczys/STM32-rotating-cube/src/main.c
#include "stm32f0xx_conf.h"

//LCD Definitions
#define LCD_PORT GPIOC->ODR
#define LCD_DDR  DDRC
#define LCD_CLK (1<<0)
#define LCD_SIO (1<<1)
#define LCD_CS  (1<<2)
#define LCD_RST (1<<3)

#define PAGE_SIZE	97
#define ROW_SIZE	66

#define red	0b00000111
#define yellow	0b00111111
#define green	0b00111100
#define cyan	0b11111000
#define blue	0b11000000
#define magenta	0b11000111
#define white	0b11111111
#define black	0b11111111


/* SPI Definitions */
#define SPIx                             SPI1
#define SPIx_CLK                         RCC_APB2Periph_SPI1
#define SPIx_GPIO_PORT                   GPIOA
#define SPIx_GPIO_CLK                    RCC_AHBPeriph_GPIOA
#define SPIx_AF                          GPIO_AF_0
#define SPIx_SCK_PIN                     GPIO_Pin_5
#define SPIx_SCK_SOURCE                  GPIO_PinSource5
#define SPIx_MISO_PIN                    GPIO_Pin_6
#define SPIx_MISO_SOURCE                 GPIO_PinSource6
#define SPIx_MOSI_PIN                    GPIO_Pin_7
#define SPIx_MOSI_SOURCE                 GPIO_PinSource7
#define SPIx_NSS_PIN                     GPIO_Pin_4
#define SPIx_NSS_SOURCE                  GPIO_PinSource4

/* Button Debounce Definitions */
//#define KEY_DDR		DDRB
//#define KEY_PORT	PORTB
#define KEY_PIN		GPIOA->IDR
#define KEY0		0	//Mode button
//#define KEY1		6	//Next
//#define KEY2		5	//+
//#define KEY3		4       //-
//Debounce
#define REPEAT_MASK   (1<<KEY0)   // repeat: key1, key2 
#define REPEAT_START   50      // after 500ms 
#define REPEAT_NEXT   20      // every 200ms
volatile uint16_t key_press;
volatile uint16_t key_state;
volatile uint16_t key_rpt;

//Variables
unsigned char cursor_x = 0;	// Tracks cursor position (top-left corner)
unsigned char cursor_y = 0;	// Tracks cursor position (top-left corner)
static __IO uint32_t TimingDelay;
SPI_InitTypeDef SPI_InitStructure;


void LCD_init(void);
void LCD_Out(unsigned char Data, unsigned char isCmd);
void StripedScreen(void);
void Hello_World(void);
void _delay_ms(__IO uint32_t nTime);
void TimingDelay_Decrement(void);

/*--------------------------------------------------------------------------
  FUNC: 8/1/11 - Used to read debounced button presses
  PARAMS: A keymask corresponding to the pin for the button you with to poll
  RETURNS: A keymask where any high bits represent a button press
--------------------------------------------------------------------------*/
unsigned char get_key_press( unsigned char key_mask )
{
  __disable_irq ();			// read and clear atomic !
  key_mask &= key_press;	// read key(s)
  key_press ^= key_mask;	// clear key(s)
  __enable_irq ();
  return key_mask;
}

/*--------------------------------------------------------------------------
  FUNC: 8/1/11 - Used to check for debounced buttons that are held down
  PARAMS: A keymask corresponding to the pin for the button you with to poll
  RETURNS: A keymask where any high bits is a button held long enough for
		its input to be repeated
--------------------------------------------------------------------------*/
unsigned char get_key_rpt( unsigned char key_mask ) 
{ 
  __disable_irq ();               // read and clear atomic ! 
  key_mask &= key_rpt;                           // read key(s) 
  key_rpt ^= key_mask;                           // clear key(s) 
  __enable_irq (); 
  return key_mask; 
} 

/*--------------------------------------------------------------------------
  FUNC: 8/1/11 - Used to read debounced button released after a short press
  PARAMS: A keymask corresponding to the pin for the button you with to poll
  RETURNS: A keymask where any high bits represent a quick press and release
--------------------------------------------------------------------------*/
unsigned char get_key_short( unsigned char key_mask ) 
{ 
  __disable_irq ();         // read key state and key press atomic ! 
  return get_key_press( ~key_state & key_mask ); 
} 

/*--------------------------------------------------------------------------
  FUNC: 8/1/11 - Used to read debounced button held for REPEAT_START amount
	of time.
  PARAMS: A keymask corresponding to the pin for the button you with to poll
  RETURNS: A keymask where any high bits represent a long button press
--------------------------------------------------------------------------*/
unsigned char get_key_long( unsigned char key_mask ) 
{ 
  return get_key_press( get_key_rpt( key_mask )); 
} 

void LCD_init(void)
{
  //Hardware Reset
  LCD_PORT &= ~LCD_RST;
  _delay_ms(5);
  LCD_PORT |= LCD_RST;
  _delay_ms(5);

  //Software Reset
  LCD_Out(0x01, 1);
  _delay_ms(10);

/*
  //Refresh set
  LCD_Out(0xB9, 1);
  LCD_Out(0x00, 0);
*/


  //Display Control
  LCD_Out(0xB6, 0);
  LCD_Out(128, 0);
  LCD_Out(128, 0);
  LCD_Out(129, 0);
  LCD_Out(84, 0);
  LCD_Out(69, 0);
  LCD_Out(82, 0);
  LCD_Out(67, 0);


/*
  //Temperature gradient set
  LCD_Out(0xB7, 1);
  for(char i=0; i<14; i++)  LCD_Out(0, 0);
*/

  //Booster Voltage On
  LCD_Out(0x03, 1);
  _delay_ms(50);  //NOTE: At least 40ms must pass between voltage on and display on.
		  //Other operations may be carried out as long as the display is off
		  //for this length of time.

/*
  //Test Mode
  LCD_Out(0x04, 1);
*/

/*
  // Power Control
  LCD_Out(0xBE, 1);
  LCD_Out(4, 0);
*/

  //Sleep Out
  LCD_Out(0x11, 1);

  //Display mode Normal
  LCD_Out(0x13, 1);

  //Display On
  LCD_Out(0x29, 1);

  //Set Color Lookup Table
  LCD_Out(0x2D, 1);		//Red and Green (3 bits each)
  char x, y;
  for(y = 0; y < 2; y++) {
	  for(x = 0; x <= 14; x+=2) {
		  LCD_Out(x, 0);
	  }
  }
  //Set Color Lookup Table	//Blue (2 bits)
  LCD_Out(0, 0);
  LCD_Out(4, 0);
  LCD_Out(9, 0);
  LCD_Out(14, 0);

  //Set Pixel format to 8-bit color codes
  LCD_Out(0x3A, 1);
  LCD_Out(0b00000010, 0);

//***************************************
//Initialization sequence from datasheet:

//Power to chip
//RES pin=low
//RES pin=high -- 5ms pause
//Software Reset
//5ms Pause
//INIESC
  //<Display Setup 1>
    //REFSET
    //Display Control
    //Gray Scale position set
    //Gamma Curve Set
    //Common Driver Output Select
  //<Power Supply Setup>
    //Power Control
    //Sleep Out
    //Voltage Control
    //Write Contrast
    //Temperature Gradient
    //Boost Voltage On
  //<Display Setup 2>
    //Inversion On
    //Partial Area
    //Vertical Scroll Definition
    //Vertical Scroll Start Address
  //<Display Setup 3>
    //Interface Pixel Format
    //Colour Set
    //Memory access control
    //Page Address Set
    //Column Address Set
    //Memory Write
  //Display On

//****************************************
}

/*--------------------------------------------------------------------------
  FUNC: 6/23/12 - Writes 9-bits on SPI bus
  PARAMS: 8-bits of data, 1 to signify that the data is an LCD command
  RETURNS: None
--------------------------------------------------------------------------*/
void LCD_Out(unsigned char Data, unsigned char isCmd) 
{
  //Wait until transmit buffer is ready
  //TODO: Add timeout just in case
  while(SPI_I2S_GetFlagStatus(SPIx, SPI_I2S_FLAG_TXE) == RESET) ;;
  //Commands start with 0
  if (isCmd) SPI_I2S_SendData16(SPIx, (uint16_t)Data);
  //Data starts with 1
  else SPI_I2S_SendData16(SPIx, ((uint16_t)Data | (1<<8)));
}

static void SPI_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable the SPI peripheral */
  RCC_APB2PeriphClockCmd(SPIx_CLK, ENABLE);
  /* Enable SCK, MOSI, MISO and NSS GPIO clocks */
  RCC_AHBPeriphClockCmd(SPIx_GPIO_CLK, ENABLE);


  /* SPI pin mappings */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_DOWN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_Level_3;

  /* SPI SCK pin configuration */
  GPIO_InitStructure.GPIO_Pin = SPIx_SCK_PIN;
  GPIO_Init(SPIx_GPIO_PORT, &GPIO_InitStructure);

  /* SPI  MOSI pin configuration */
  GPIO_InitStructure.GPIO_Pin =  SPIx_MOSI_PIN;
  GPIO_Init(SPIx_GPIO_PORT, &GPIO_InitStructure);

  /* SPI MISO pin configuration */
  //GPIO_InitStructure.GPIO_Pin = SPIx_MISO_PIN;
  //GPIO_Init(SPIx_MISO_GPIO_PORT, &GPIO_InitStructure);
  
  /* SPI NSS pin configuration */
  GPIO_InitStructure.GPIO_Pin = SPIx_NSS_PIN;
  GPIO_Init(SPIx_GPIO_PORT, &GPIO_InitStructure);
  
  /* SPI configuration -------------------------------------------------------*/
  SPI_I2S_DeInit(SPIx);
  SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Tx;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_9b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Hard;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  
  SPI_Init(SPIx, &SPI_InitStructure);
  SPI_SSOutputCmd(SPIx, ENABLE);
  SPI_Cmd(SPIx, ENABLE);

}

void StripedScreen(void)
{
  unsigned char color_palate[] = {
	//BBGGGRRR
	0b00000111,	//Red
	0b00111111,	//Yellow
	0b00111100,	//Green
	0b11111000,	//Cyan
	0b11000000,	//Blue
	0b11000111,	//Magenta
	0b11111111,	//White
	0b00000111	//This should be 0x00(black) but for screen wrapping it was changed to Red
  };

  LCD_Out(0x13, 1);
  for (unsigned char i=0; i<8; i++)
  {
    LCD_Out(0x2A, 1);
    LCD_Out(0, 0);
    LCD_Out(97, 0);
    LCD_Out(0x2B, 1);
    LCD_Out(i*9, 0);
    LCD_Out((i*9)+8, 0);
    LCD_Out(0x2C, 1);
    for (int j=0; j<882; j++)
    {
      LCD_Out(color_palate[i], 0);
    }
  }
}

void Hello_World(void)
{
  //Binary representation of "Hello World"
  unsigned char Hello_World[5][5] = {
    { 0b10101110, 0b10001000, 0b01001010, 0b10010011, 0b00100110 },
    { 0b10101000, 0b10001000, 0b10101010, 0b10101010, 0b10100101 },
    { 0b11101100, 0b10001000, 0b10101010, 0b10101011, 0b00100101 },
    { 0b10101000, 0b10001000, 0b10101010, 0b10101010, 0b10100101 },
    { 0b10101110, 0b11101110, 0b01000101, 0b00010010, 0b10110110 }
  };

    LCD_Out(0x2A, 1);
    LCD_Out(8, 0);
    LCD_Out(87, 0);
    LCD_Out(0x2B, 1);
    LCD_Out(23, 0);
    LCD_Out(32, 0);
    LCD_Out(0x2C, 1);
    for (unsigned char i=0; i<5; i++) //Scan Rows
    {
      char h=2;
      while(h)
      {
	for (unsigned char k=0; k<5; k++) //Scan Columns
	{
	  for (char j=0; j<8; j++)
	  {
	    if (Hello_World[i][k] & 1<<(7-j))	//Should there be a letter pixel here?
	    {
	      LCD_Out(0x00, 0);			//yes - draw it in black
	      LCD_Out(0x00, 0);			
	    }
	    else 
	    {
	      LCD_Out(0xFF, 0);			//no - draw background in white
	      LCD_Out(0xFF, 0);
	    }
	  }
	}
	--h;
      }
    }
}

/*--------------------------------------------------------------------------
  FUNC: 6/23/12 - Draws a colored box (infilled) on the screen
  PARAMS: x,y coordinates for upper left and lower right 
          corners of the screen, color (BBGGGRRR)
  RETURNS: None
--------------------------------------------------------------------------*/
void Draw_Box(uint8_t upperX, uint8_t upperY, uint8_t lowerX, uint8_t lowerY, uint8_t color)
{

  if (upperX >= PAGE_SIZE) upperX = PAGE_SIZE-1;
  if (upperY >= ROW_SIZE) upperY = ROW_SIZE-1;
  if (lowerX > PAGE_SIZE) lowerX = PAGE_SIZE;
  if (lowerY > ROW_SIZE) lowerY = ROW_SIZE;
  uint16_t pixel_calc = (lowerX-upperX+1)*(lowerY-upperY+1);

  LCD_Out(0x2A, 1); //Set Column location
  LCD_Out(upperX, 0);
  LCD_Out(lowerX, 0);
  LCD_Out(0x2B, 1); //Set Row location
  LCD_Out(upperY, 0);
  LCD_Out(lowerY, 0);
  LCD_Out(0x2C, 1); //Write Data
  for (int i=0; i<pixel_calc; i++) LCD_Out(color, 0);
}

void Fill_Screen(unsigned char color)
{
  LCD_Out(0x2A, 1); //Set Column location
  LCD_Out(0, 0);
  LCD_Out(97, 0);
  LCD_Out(0x2B, 1); //Set Row location
  LCD_Out(0, 0);
  LCD_Out(66, 0);
  LCD_Out(0x2C, 1); //Write Data
  for (int i=0; i<6566; i++) LCD_Out(color, 0);
}

void _delay_ms(__IO uint32_t nTime)
{
  TimingDelay = nTime;

  while(TimingDelay != 0);
}

/**
  * @brief  Decrements the TimingDelay variable.
  * @param  None
  * @retval None
  */
void TimingDelay_Decrement(void)
{
  if (TimingDelay != 0x00)
  { 
    TimingDelay--;
  }
}


void SysTick_Handler(void) {
  static uint16_t tick = 0;
  static uint16_t ten_ms_tick = 0;

  switch (tick++) {
    case 1000:
      tick = 0;
      GPIOC->ODR ^= (1 << 8);
      break;
  }
  
  TimingDelay_Decrement();
  
  if (ten_ms_tick++ > 9) {
    ten_ms_tick = 0;
  	
    static unsigned char ct0, ct1, rpt;
    uint16_t i;

    i = key_state ^ KEY_PIN;    // key changed ?
    ct0 = ~( ct0 & i );          // reset or count ct0
    ct1 = ct0 ^ (ct1 & i);       // reset or count ct1
    i &= ct0 & ct1;              // count until roll over ?
    key_state ^= i;              // then toggle debounced state
    key_press |= key_state & i;  // 0->1: key press detect

    if( (key_state & REPEAT_MASK) == 0 )   // check repeat function 
      rpt = REPEAT_START;      // start delay 
    if( --rpt == 0 ){ 
      rpt = REPEAT_NEXT;         // repeat delay 
      key_rpt |= key_state & REPEAT_MASK; 
    } 
  
  }
}

int main(void)
{
	SysTick_Config(SystemCoreClock/1000);
	RCC->AHBENR |= RCC_AHBENR_GPIOAEN;
	SPI_Config();
	
	RCC->AHBENR |= RCC_AHBENR_GPIOCEN; 	// enable the clock to GPIOC
						//(RM0091 lists this as IOPCEN, not GPIOCEN)
	GPIOC->MODER |= (1<<16) | (1<<6);
	//GPIOC->SPEEDR 
	LCD_PORT |= LCD_RST;
	
	LCD_init();
	
	StripedScreen();
	Hello_World();

	while(1)
	{
	  if( get_key_press( 1<<KEY0 )) { 
	    static unsigned char but_temp = 0;
	    if (but_temp++) {
	      but_temp = 0;
	      Draw_Box(0,0,97,66,green);
	    }
	    else Draw_Box(10,10,19,19,white); 
	    }
	}

}
